AI-850 
OPERATION MANUAL 
Version : 1.11 
Revised : 2024-10-11 
AI-850 Weighing Indicator                                            
본 제품의 특징  
◆ 본 제품은 외부의 전기적 노이즈에 매우 강하게 설계되어 있습니다. 
주의 
◆본 설명서의 내용은 예고 없이 변경될 수 있습니다. 
◆본 설명서의 내용이 잘못되거나 기재가 누락된 곳 등 문의 사항이 있으면 구매하신 
곳으로 연락 주십시오. 
◆제품의 성능 향상의 위하여 예고 없이 기능이 변경될 수 있습니다. 
해당 표시는 취급을 잘못 할 경우 상해를 입거나, 물질적 손실을 발생시킬 
가능성이 있는 경우에 표기됩니다.                                                                     
조작에 대한 부가 설명 및 참고사항이 있는 경우 표기 됩니다. 
설치 전 유의사항 
본 제품은 정밀 전자기기로 취급 시 아래와 같은 주의가 필요합니다. 
본 제품은 전원 코드가 연결되는 순간, 곧바로 전원이 투입되고 제품이 동작합니다. 
점검 및 배선 등의 작업을 할 경우에는 반드시 메인 전원 및 차단기를 꺼 주십시오. 
◆진동이 심한 곳에서는 사용하지 마십시오. 
◆전원 선은 동력 선과 공용으로 사용하지 않도록 주의하십시오. 
◆본 장비는 반드시 접지해서 사용해 주십시오.  
접지 하지 않으면, 진동, 발화, 오 동작 등의 사고가 발생할 위험이 있습니다. 
◆순간적으로 과도한 충격을 주지 마십시오. 
◆운용 중에는 제품이 비를 맞지 않게 주의하여 주십시오. 
◆급격한 온도변화가 있는 장소는 가급적 피하십시오. 
◆고압이나 전기적 잡음이 심함 곳에는 설치하지 마십시오.  
◆사용자 임의로 절대로 개조, 분리 혹은 수리하지 마십시오. 
◆키는 가볍게 눌러도 동작이 되니 지나친 힘을 가하지 마십시오. 
1 
AI-850 Weighing Indicator                                            
 
 
2 
INDEX 
1. 제품 사양 .................................................................................................................................................................................. 5 
2. 전면 패널 .................................................................................................................................................................................. 6 
3. 후면 패널 .................................................................................................................................................................................. 7 
4. 설치 방법 .................................................................................................................................................................................. 8 
5. 결선 방법 .................................................................................................................................................................................. 9 
5.1. 전원선 ................................................................................................................................................................................ 9 
5.2. 부하 센서 ....................................................................................................................................................................... 10 
6. 관리자 모드 .......................................................................................................................................................................... 11 
6.1. 실 부하 교정 ................................................................................................................................................................. 11 
6.2. 등가 입력 교정 ............................................................................................................................................................ 14 
6.3. 중력 가속도 보정 ........................................................................................................................................................ 16 
6.4. 교정 변경 ....................................................................................................................................................................... 18 
1) 영점 변경 .................................................................................................................................................................... 18 
2) 분해도 변경 ................................................................................................................................................................ 18 
3) 스판상수 변경 ........................................................................................................................................................... 19 
4) 센서방향 변경 ........................................................................................................................................................... 19 
6.5. 유지보수 ........................................................................................................................................................................ 20 
1) 교정 정보 .................................................................................................................................................................... 20 
2) 테스트 모드 ................................................................................................................................................................ 20 
3) 공장초기화 ................................................................................................................................................................. 21 
4) 백업 및 복원 .............................................................................................................................................................. 21 
5) 비밀번호 변경 ........................................................................................................................................................... 22 
6) 재부팅 .......................................................................................................................................................................... 22 
7) 장비 정보 .................................................................................................................................................................... 22 
6.6. 중량 보정 ....................................................................................................................................................................... 22 
7. 설정 메뉴 ............................................................................................................................................................................... 23 
7.1. 표시 및 조작 ................................................................................................................................................................. 23 
1) 언어 ............................................................................................................................................................................... 23 
2) 화면밝기 ...................................................................................................................................................................... 23 
3) 부저음 .......................................................................................................................................................................... 23 
4) 시간 설정 .................................................................................................................................................................... 24 
AI-850 Weighing Indicator                                            
 
 
3 
5) F1~F5 키 용도 지정 ................................................................................................................................................ 24 
6) 키 작동 제한 .............................................................................................................................................................. 24 
7) 측정 단위 .................................................................................................................................................................... 24 
8) 터치키 .......................................................................................................................................................................... 24 
7.2. 측정 파라미터 .............................................................................................................................................................. 25 
1) 변환 속도 .................................................................................................................................................................... 25 
2) LP Filter (로우패스 필터) ...................................................................................................................................... 25 
3) MA Filter (이동평균 필터) .................................................................................................................................... 26 
4) 영점 동작 범위 ......................................................................................................................................................... 26 
5) 영점 트래킹 시간 ..................................................................................................................................................... 26 
6) 영점 트래킹 폭 ......................................................................................................................................................... 27 
7) 안정 검출 시간 ......................................................................................................................................................... 27 
8) 안정 검출 폭 .............................................................................................................................................................. 27 
9) 중량 백업 기능 ......................................................................................................................................................... 27 
10) 홀드 기능 .................................................................................................................................................................. 27 
7.3. 시리얼 통신 ...................................................................................................................................................................... 28 
1) RS232, RS485 ............................................................................................................................................................ 28 
(1) 통신속도 .................................................................................................................................................................... 28 
(2) 데이터 비트 .............................................................................................................................................................. 28 
(3) 스톱 비트 ................................................................................................................................................................... 28 
(4) 패리티 비트 .............................................................................................................................................................. 28 
(5) 통신 모드 ................................................................................................................................................................... 29 
(6) 통신 포맷 ................................................................................................................................................................... 29 
7.4. 프린터 설정 .................................................................................................................................................................. 30 
1) 프린터 .......................................................................................................................................................................... 30 
2) 인쇄 모드 .................................................................................................................................................................... 30 
3) 인쇄항목 ...................................................................................................................................................................... 30 
4) 용지배출 ...................................................................................................................................................................... 31 
7.5. 비교기 설정 .................................................................................................................................................................. 31 
1) 모드 ............................................................................................................................................................................... 31 
2) 영점 부근 값 .............................................................................................................................................................. 41 
4) 출력 접점 .................................................................................................................................................................... 41 
5) 출력 지연시간 ........................................................................................................................................................... 41 
6) 출력 유지시간 ........................................................................................................................................................... 41 
AI-850 Weighing Indicator                                            
 
 
4 
7) IN1~IN4 ...................................................................................................................................................................... 42 
7.6. BCD 출력 ....................................................................................................................................................................... 42 
1) 데이터 로직 ................................................................................................................................................................ 42 
2) 완료신호 유지 ........................................................................................................................................................... 42 
3) 자릿수 변환지연 ...................................................................................................................................................... 42 
7.7. 아날로그 출력 .............................................................................................................................................................. 44 
1) 출력 모드 .................................................................................................................................................................... 44 
2) 최대 출력값 ................................................................................................................................................................ 44 
3) 최소값 보정 ................................................................................................................................................................ 44 
4) 최대값 보정 ................................................................................................................................................................ 44 
7.8. 이더넷 설정 .................................................................................................................................................................. 46 
1) DHCP ............................................................................................................................................................................ 46 
2) 수동 IP ......................................................................................................................................................................... 46 
3) 통신 방식 .................................................................................................................................................................... 46 
4) 서버 IP ......................................................................................................................................................................... 46 
5) 포트 번호 .................................................................................................................................................................... 46 
6) 모드 ............................................................................................................................................................................... 47 
7) 통신 포맷 .................................................................................................................................................................... 47 
8) 통신 정보 .................................................................................................................................................................... 47 
8. 시리얼 인터페이스 ............................................................................................................................................................ 48 
8.1. 전송 데이터 포맷 ........................................................................................................................................................ 48 
8.2. 커맨드 전송 포맷 ........................................................................................................................................................ 51 
9. 외부 입출력 비교기 ........................................................................................................................................................... 55 
9.1. 외부 입력 결선 ............................................................................................................................................................ 55 
9.2. 외부 출력 결선 ............................................................................................................................................................ 55 
10. MODBUS-RTU .................................................................................................................................................................. 56 
11. MODBUS-TCP ................................................................................................................................................................... 61 
12. 커맨드 수신 모드 ............................................................................................................................................................. 62 
13. 에러 메세지 ....................................................................................................................................................................... 62 
14. 펌웨어 업데이트 .............................................................................................................................................................. 63 
AI-850 Weighing Indicator                                            
 
 
5 
1. 제품 사양 
케이스 재질 ABS 
표시 부 3.46인치 풀 컬러 IPS TFT LCD 및 저항식 터치패널 
유효 분해도 24비트 
ADC 변환 속도 최대 5,000회/초 
센서 인가 전압 5VDC (350Ω 적용 시, 최대 8개) 
입력 감도 및 범위 0.1uV/D, 0~39mV (-19.5~19.5mV) 
외부 입출력 
4 입력 (포토커플러) 
4 출력 (PhotoMos 릴레이 AC/DC 350V, 120mA) 
시리얼 인터페이스 RS-232C 
옵션 사항 
OP-02: RS485 (modbus) 
OP-05: 이더넷 
OP-06: Wi-Fi (802.11 b/g/n) 
OP-07: Bluetooth (BLE 5.0) 
OP-11: 아날로그 출력 (0~24mA, - 10~10V) 
OP-12: BCD 출력 
OP-22: 24VDC 전원 
OP-24: 3V 저 전압 센서용 전원 
OP-31: DIN 레일 브라켓 
전원 사양 85~305VAC, 47~63Hz, 5W 
(OP-22 선택 시, 18~36VDC, 5W) 
제품사용온도 -20˚C~60˚C 
제품동작습도 85% R.H. (결로현상이 없는 곳) 
제품 무게 약 0.16kg 
 
  
AI-850 Weighing Indicator                                            
2. 전면 패널 
화면에 표시되는 설명 및 조작 법을 참고 하시어 장비를 운용하시기 바랍니다.  
No 
명칭 기능
1 측정 모드 선택 된 비교 출력 모드를 표시합니다. 
2 인터넷 
옵션 선택한 이너넷 또는 WiFi 아이콘을 표시합니다. 
3 블루투스 
옵션 선택한 블루투스 아이콘을 표시합니다. 
4 품번 
비교 모드의 품번을 표시합니다. [품번]을 누르면 품번 및 비교 
모드 설정 값을 편집할 수 있습니다. 
5 상태 램프 영점, 홀드, 총 중량, 순 중량, 전송, 수신 상태를 램프로 
표시합니다. 
6 외부입력표시 외부 입력 ON시에 해당 램프를 점등합니다. (IN1: 맨 좌측 램프) 
7 측정 값 표시 센서 측정 값을 실시간으로 표시합니다. 
8 날짜 및 시간  날짜 및 시간을 표시합니다. 
9 비교모드상태 비교 모드의 설정 값을 표시하며 측정 값의 비교 모드  
동작상태를 설정 값에 따라 색m상을 달리하여 표시합니다. 
10 중량보정램프 중량 보정 기능을 사용하면 중량 보정램프를 화면에 표시합니다. 
11 안정램프 
측정된 무게의 안정 상태를 램프로 표시합니다. 
12 측정 단위 
센서의 측정 단위를 표시합니다. 
단위가 N, kgf 또는 Nm, kgf*m로 교정된 경우에는, [단위]를 
누르면 전환 가능한 단위로 변환 및 환산되어 표시됩니다. 
13 조작 키 
화면 터치로 동작하며, 설정한 동작을 수행합니다. 
6 
AI-850 Weighing Indicator                                            
3. 후면 패널 
No 
명칭 
1 
AC-L, AC-N 
(OP-22: DC24, GND) 
기능 
AC 버전 전원 결선 단자 
(OP-22 선택 시, DC 전원 결선 단자) 
FG 
외부 접지 단자 
TXD, RXD 
RS-232C 통신 신호 단자 
GND 
R2-232C / RS-485 통신 접지 단자 
485-A, 485-B 
RS-485 통신 신호 단자 
2 
EX+, EX- 
센서 전압 공급 단자 
SIG+, SIG- 
센서 신호 입력 단자 
COM 
센서 접지 단자 
IN1~4 
외부 입력 신호 단자 
COM 
외부 입력 공통 단자 
3 
OUT1~4 
외부 출력 신호 단자 
COM 
외부 출력 공통 단자 
7 
AI-850 Weighing Indicator                                            
4. 설치 방법 
본 제품은 슬라이드 레일 브라켓으로 판넬에 고정됩니다. (판넬 마운트 방식) 
판넬의 두께는 2~5mm 이내의 강판을 사용하십시오. 
설치 시에는 먼저, 본체로부터 사이드 브라켓을 분리하십시오. 
본 기기를 94 x 46mm 사이즈로 절삭 된 판넬 전면에서 밀어 넣은 후, 판넬 안쪽에서 사이드 
브라켓을 본 제품에 밀어 넣어 고정하여 주십시오. 
◆ 제품 사이즈 (단위: mm) 
8 
AI-850 Weighing Indicator                                            
5. 결선 방법 
단자 대는 튀어나온 버튼을 누른 상태에서 구멍에 연결선을 끼워 놓은 후에 버튼을 놓으면 
결선이 이뤄집니다. 결선 후에는 연결선을 살짝 당겨 결선이 제대로 이뤄졌는지 
확인하십시오. 
반드시 전원을 차단 또는 분리한 후에 결선하십시오. 
결선 작업 시, 각 부의 위치 및 용도를 반드시 확인하시고 안전 사고에 유의하시기 
바랍니다. 
단자대 연결 가능한 와이어의 사이즈는 코어 직경 0.2~1.5 (AWG 24~16)입니다. 
와이어 피복을 벗긴 부위는 10mm가 적당하며, 연선으로 이뤄진 경우에는 납으로 
뭉쳐주거나 I-터미널을 사용하십시오. (추천 CE005010 Φ1.3 터미널) 
5.1. 전원선 
연결 단자 
AC 전원 (기본) 
DC 전원 (OP-22) 
○ 
85~305VAC 
○ 
FG 
18~36VDC  
(극성무관) 
Flame GND 
본 제품에 표기된 전원 사양을 반드시 확인한 후에 전원 선을 연결하십시오.  
기본 사양인 경우에는 85~305VAC, 50/60Hz 전원 선,  
OP-22 DC전원 선택 시에는 반드시 24VDC 전원 선을 연결하여야 합니다. 
반드시 분전함의 전원 차단기를 내린 상태에서 결선하십시오. 
본 장비는 반드시 접지해서 사용해 주십시오. 
접지하지 않으면, 진동, 발화, 오 동작 등의 사고가 발생할 수 있습니다.  
9 
AI-850 Weighing Indicator                                            
5.2. 부하 센서  
연결 단자 
로드셀 연결 
6 
EX+ 
7 
EX- 
8 
SIG+ 
9 
10 
SIG- 
COM 
센서 선 색상은 제조사 및 모델 별로 상이하므로 적용 모델의 규격을 확인 하십시오. 
잘못된 연결로 인디케이터 내부에 손상을 입힐 수 있으니 주의하십시오. 
센서 신호는 미세 전압을 사용하므로 센서 근처에서 용접 작업과 같은 노이즈 원에 의해 
센서가 파손될 수 있으니 주의하시기 바랍니다. 
1) 로드셀 연결 
로드셀 연결 최대 연결 가능 수는 350옴 센서 8개 입니다. 
◆ 스트레인게이지 센서 입력감도 계산 
아래의 조건 식을 통해 해당 센서의 출력이 충분한지 검토한 후에 설치하십시오. 
EV: 센서 인가 전압 [mV] 
RO: 센서 정격 출력 [mV/V] 
e: 측정 눈금 [kg] 
LC: 센서 정격 용량 [kg] 
N: 센서 개수 
0.1 ≤ (EV x RO x e) / (LC x N) 
인디케이터의 입력 감도는 0.1V/D 이므로, 
계산식이 크거나 같아야 함 
Example 
센서 인가 전압: EC=5000mV 
센서 정격 출력: RO=2mV/V 
측정 눈금: e=0.01kg 
센서 정격 용량: LC=1,000kg  
센서 개수: N=1 
0.1 = (5000 × 2 × 0.01) / (1000 × 1) 
10 
AI-850 Weighing Indicator                                            
6. 관리자 모드 
전원을 켜고 초기 화면에서 측정값 표시 부를 터치 하면 설정 메뉴로 이동합니다. 
[표시 및 조작]-[터치키]가 0초[OFF]가 아니라면 설정된 시간동안 길게 눌러 설정 메뉴로 
이동할 수 있습니다. 
교정이 이뤄지지 않은 제품의 측정 값은 공란으로 표시됩니다. 
설정 메뉴에서 [ ] 키를 1초간 누르면 [관리자 모드 비밀번호] 메뉴로 이동합니다. 
해당메뉴에서 올바른 비밀번호를 입력하면 관리자 모드로 이동합니다. 
기본 비밀번호 : 0000, 마스터 비밀번호 : 0814 
6.1. 실 부하 교정 
센서에 표준 실제 부하(하중, 변위, 압력 등) 를 가하여 교정하는 모드입니다. 
1) 센서의 동작 방향 선택 
2) 교정 구간 선택 
센서의 동작 방향을 선택하십시오. 
양방향 선택 시에는 정/역 방향으로 측정이 
가능합니다. 
토크센서의 경우에는 반드시 양방향으로 
설정하십시오. 
교정 구간값을 입력하고 1구간으로 직선성이 
보장되지 않을 경우에는 2구간~10구간 중 
원하는 구간을 선택하십시오. 성능이 좋지 않은 
센서의 직선성을 소프트웨어로 보정합니다. 
11 
AI-850 Weighing Indicator                                            
3) 부하의 최대표시 용량 설정 
입력해야 합니다. 
4) 최소표시 눈금 선택 
5) 영점 교정 실행 
6) 스판 교정 실행 
부하의 최대 표시 용량을 입력하십시오. 
최대는 999,999 까지 입력됩니다. 
소숫점  자리수를 감안하여 입력하여야 합니다. 
최대용량이 1000이고 소수점 1자리(0.0)을 
사용하신다면 최대용량을 5자리인 10000으로 
최소 표시 눈금을 선택하십시오.
영점 교정을 실행합니다. 
화면에 ADC 값이 실시간으로 표시됩니다. 
영점상태 값이 안정되면 [다음] 키를 누르십시오. 
교정 부하 값을 입력하고 스판 교정을 
실행합니다. 
1 구간 선택일 경우, 직선성을 높이기 위해    
최대용량의 10% 이상의 부하를 사용해야 
합니다. 
예제 화면은 5구간 선택일 경우, 첫 번째 구간의 교정 부하 값 입력 화면입니다. 
5 구간 선택일 경우에는 차례대로 5번의 스판 교정을 실행하십시오. 
각 구간의 입력 값은 가압하거나 올려 놓은 분동의 총 누계 량을 입력해야 하며, 실제 
가압과 숫자 입력의 순서는 바뀌어도 관계가 없습니다. 
다만, [다음] 키를 누르는 시점에 가압한 용량이 변하지 않도록 주의하십시오.  
12 
AI-850 Weighing Indicator                                            
7) 소수점 자릿수 설정 
8) 실시간으로 부하값 표시 
소수점 자릿수를 선택하십시오. 
스판 교정이 끝나면 화면에 실시간으로 부하 
값을 표시합니다. 
올바르게 교정이 이뤄졌는지 확인 후에 [저장] 
키를 눌러 교정을 마칩니다. 
[재시도] 키를 누르면 순서 5 영점교정 단계로 돌아가 재 교정을 할 수 있습니다. 
9) 교정 완료 
교정 완료 화면이 잠시 표시된 후에 초기 
화면으로 복귀합니다. 
교정이 완료 되면 관리자모드 유지보수의 백업 및 복원의 첫번째 자리에 자동 저장됩니다. 
만일의 경우를 대비하여 세번째 자리에도 백업해 두세요.  
중량DATA가 문제가 생기면 언제든지 복원할 수 있습니다. 
13 
AI-850 Weighing Indicator                                            
6.2. 등가 입력 교정 
센서의 출력 값(mV/V)을 입력하여 교정하는 모드입니다.  
분해능 1/1000을 제공합니다. 
1) 센서의 동작 방향 설정 
2) 최대표시 용량 설정 
3) 최소 표시 눈금 선택 
4) 센서의 정격 용량 입력 
센서의 동작 방향을 선택하십시오. 
양방향 선택 시에는 정/역 방향으로 측정이 
가능합니다. 
부하의 최대표시 용량을 입력하십시오. 
최대는 999,999 까지 입력됩니다. 
소숫점 자리수를 감안하여 입력하여야 합니다. 
소수점2자리(0.00)라면 1000이 최대용량일 때 
100000 의 6자리를 입력해야 합니다. 
최소 표시 눈금을 선택하십시오  
센서 성적서에 기재된 센서의 정격 용량을 
입력하십시오. (R.C.: Rated Capacity) 
센서를 2개이상 병렬 연결하여 사용하는 경우는 
센서 용량을 모두 합친 용량을 입력해야 합니다. 
예) 1000kg 용량 4개 사용시 4000으로 입력 
14 
AI-850 Weighing Indicator                                            
5) 센서의 정격 출력값 입력 
센서 성적서에 기재된 센서의 정격 출력 값을 
입력 하십시오. (R.O.: Rated Output) 
참고로, 알루미늄으로 제작된 로드셀은 성적서의 
출력 값은 실제 출력 값과 다를 수 있으니 반드시 
고 정밀 DVM으로 실제 출력 값을 측정하여 
입력하십시오. 센서를 2개이상 병렬 연결하여 사용하는 경우는 센서 출력의 평균 출력 값을 
입력해야 합니다. 
예) 센서 4개 사용시 출력 값이 각각 2.0103 / 1.9992 / 2.0013 / 1.9953일 경우, 
합산 출력 값 8.005/ 4 = 2.0015 로 입력합니다. 
2 개 이상의 센서를 병렬 연결한 후 등가입력방식 교정을 사용할 경우는 summing  
box 에 장착된 저항이 출력에 영향을 줄 수 있습니다. 
저항이 없는 summing box를 사용하거나 저항을 경유하지 않고 인디케이터에 출력을 
보낼 수 있는 BYPASS 기능이 있는 summing box 사용을 권장합니다. 
추천 모델: 카스코리아(CASKOREA)의 CJB-3PA (3 POINT), CJB-4PA (4 POINT) 
6) 센서 인가 전압 
정확한 전압을 입력하여 교정하는 단계입니다. 
센서를 연결한 상태에서 측정한 인가 전압 (EX+, 
EX-)을 입력하십시오.  
기본값: 4.9674V 
이 메뉴는 하드웨어 버전 1.00에서만 진입합니다. 
7) 소수점 자릿수 설정 
8) 실시간으로 부하 값 확인 
스판 교정이 끝나면 화면에 실시간으로 부하 값을 
표시 합니다. 
올바르게 교정이 이뤄졌는지 확인 후에 [저장] 
키를 눌러 교정을 마칩니다. 
[재시도] 키를 누르면 순서 5 센서의 정격 출력 값 입력 단계로 돌아가 재 교정을 할 수 
있습니다. 
15 
AI-850 Weighing Indicator                                            
9) 교정 완료 
6.3. 중력 가속도 보정 
교정 완료 화면이 잠시 표시된 후에 초기 
화면으로 복귀합니다. 
실 부하 교정 장소와 중력 가속도 값이 다른 타 국가 및 지역에서 사용할 경우, 사용 장소의 
중력 가속도 값을 입력하여 측정 값 보정을 하는 모드로 해당 사항이 없으면 사용하지 
않습니다. 
1) 중력 가속도 보정 
2) 교정 장소 중력 가속도 입력 
3) 사용 장소 중력 가속도 입력 
교정 장소와 사용 장소의 중력가속도 값이 같으면 
보정이 이뤄지지 않습니다. 
중력 가속도 값을 변경할 장소를 선택하십시오. 
교정 장소의 중력 가속도를 입력하십시오. 
국내 중력가속도는 9.797~9.800m/s2 입니다. 
값을 모르면 9.799 기본 값을 적용하십시오. 
아래의 중력 가속도 테이블을 참고하여 사용 
장소의 중력 가속도를 입력하십시오. 
16 
AI-850 Weighing Indicator                                            
◆ 중력 가속도 테이블 (단위: m/s2) 
Amsterdam 9.813 Manila 9.784 
Athens 
9.800 
Melbourne 
Auckland NZ 
9.799 
Mexico City 
9.800 
9.779 
Bangkok 
9.783 
Milan 
Birmingham 
9.813 
New York 
9.806 
9.802 
Brussels 
9.811 
Oslo 
Buenos Aires 
9.797 
Ottawa 
9.819 
9.806 
Calcutta 
9.788 
Paris 
Chicago 
9.803 
Rio de Janeiro 
9.809 
9.788 
Copenhagen 
9.815 
Rome 
Cyprus 
9.797 
San Francisco 
9.803 
9.800 
Djakarta 
9.781 
Singapore 
Frankfurt 
9.810 
Stockholm 
9.781 
9.818 
Glasgow 
9.816 
Sydney 
Havana 9.788 Tainan 9.788 
Helsinki 
9.797 
9.819 
Taipei 
Kuwait 
9.793 
Tokyo 
9.790 
9.798 
Lisbon 
9.801 
Vancouver, BC 
London (Greenwich) 
9.809 
9.812 
Washington DC 9.801 
Los Angeles 
9.796 
Wellington NZ 
Madrid 
9.800 
9.803 
Zurich 
9.807 
17 
AI-850 Weighing Indicator                                            
6.4. 교정 변경 
1) 영점 변경 
[저장] 키를 누르면 영점 교정을 재 실행합니다. 
기기 사용시 영점의 변화가 생긴 경우, 영점만 다시 교정하는 경우에 사용합니다. 
2) 분해도 변경 
소수점 자리수를 변경하여 분해도를 변경합니다. 
현재 표시된 값에서 마지막 자리가 제거됩니다. 
예) 현재 표시값이 1998 이라면 분해도 0.1x 설정시 199 로 표기됨. 
분해도 0.1x나 10x로 변경한 경우 이 버턴을 누르면 자리수를 원위치 
합니다. 
현재 표시된 값에서 소수점 1자리가 더 추가되어 표시됩니다. 
예) 현재 표시값이 1998 이라면 분해도 10x 설정시 1997.5~1998.4로            
표시됩니다. 
18 
AI-850 Weighing Indicator                                            
3) 스판상수 변경 
교정된 스판 상수 값을 변경하여 보정하는 
메뉴입니다. 반드시 현재의 스판상수 값을 기록한 
후 실행하십시오. 
다 구간 교정인 경우에는 단일 구간 교정으로 평균처리되어 적용되므로 주의하십시오. 
SPAN 상수 계산방법 
목표값 (표시 되어야 할 값) / 현재 표시 값 X SPAN 상수 값 = 새로운 SPAN 상수 값 
예) 표시되어야 할 값(목표값)이 9.99999인데 현재 표시 값은 9.89999 일 경우, 
1000 / 998 X 0.9876541 = 0.99763 (이 값을 상수 값에 재입력) 
화면에 조정된 값이 표시됩니다. 값이 맞으면, [저장] 키를 누르십시오. 
틀릴 경우, 위 과정을 한번 더 수행하십시오. 
(단, SPAN 상수 값이 변경되어 있으니 변경된 상수 값으로 재 계산 하여야 합니다.) 
4) 센서방향 변경 
교정 후에 센서 측정 방향만 변경하는 기능입니다. 
단방향 교정 후, 센서 설치 시 지그를 Loading 방향과 반대방향으로 설치하면 영점의 
위치가 마이너스로 변화하기 때문에 센서를 인식하지 못합니다. 
따라서, 이때에는 센서 방향 변경을 양방향으로 설정하여 영점 레벨을 높여 센서가 
인식되도록 하십시오. 
반드시 무부하상태에서 설정하여야 합니다. (지그류 설치가 완료된 무부하상태) 
방향 선택 후에는 부하를 가하지 않은 안정된 상태에서 [저장] 키를 누르십시오. 
19 
AI-850 Weighing Indicator                                            
6.5. 유지보수 
제품의 유지보수를 위한 모드입니다. 유지보수를 위한 메뉴를 선택하십시오. 
1) 교정 정보 
2) 테스트 모드 
① 부하 센서 테스트 
② 시리얼 통신 테스트 
교정 정보를 확인하십시오. 
현재 교정된 정보를 표기합니다. 
인디케이터의 하드웨어와 각종 출력 기능을 
테스트 하는 모드입니다. 
각 채널의 A/D 변환 값을 실시간 표시합니다. 
화면 표시 내용을 시리얼 통신 전송합니다. 
20 
AI-850 Weighing Indicator                                            
③ 외부 입출력 테스트 
④ 아날로그 테스트 
⑤ BCD 출력 테스트 
외부 입출력 접점 상태를 확인합니다. 
선택한 아날로그 모드의 최소값, 최대값을 
확인합니다. 
BCD상태를 실제로 출력 및 화면에 표시합니다. 
3) 공장초기화 
교정 정보를 제외하고 출하 시의 기본 설정값으로 공장초기화 합니다. 
초기화 후에는 이전 설정값으로 복귀할 수 없으니 주의바랍니다. 
4) 백업 및 복원 
백업은 3시점으로 구성됩니다. 
교정 정보 및 설정 값을 포함한 정보를 추가로 
저장하려면 비어 있는 영역에 백업 하십시오. 
[복원] 키를 누르면 백업한 시점의 모든 설정 
정보를 복원합니다. 
21 
AI-850 Weighing Indicator                                            
5) 비밀번호 변경 
관리자 모드 메뉴 진입 시 필요한 비밀번호를 변경하는 메뉴입니다. 
6) 재부팅 
7) 장비 정보 
6.6. 중량 보정 
장비를 재부팅하는 메뉴입니다. 
장비의 옵션 정보를 확인하는 메뉴입니다. 
중량 값을 보정하는 기능입니다. 
중량 보정 기능이 ON일 경우 상단에 중량 보정 램프가 활성화 됩니다. 
좌측에 인디케이터 표시 값을, 우측에 중량 보정 값(변경 목표 값)을 입력하십시오. 
예) 좌측: 0.9852 우측: 1.0000 입력 시 보정 상수 값은 1.0150으로 설정됩니다. 
22 
AI-850 Weighing Indicator                                            
7. 설정 메뉴 
제품의 작동 환경을 알맞게 변경하여 최적의 상태에서 제품 동작이 이뤄지도록 하시기 
바랍니다. 
전원을 켜고 초기 화면에서 측정값 표시 부를 누르면 설정 메뉴로 이동합니다. 
7.1. 표시 및 조작 
1) 언어 
2) 화면밝기 
3) 부저음 
화면에 표시되는 언어를 선택하십시오. 
TFT 백라이트 화면 밝기를 선택합니다. 
표시된 점을 손가락으로 눌러 원하는 밝기 위치로 
끌어 오십시오 
키 조작음 발생여부를 선택하십시오. 
23 
AI-850 Weighing Indicator                                            
4) 시간 설정 
5) F1~F5 키 용도 지정 
6) 키 작동 제한 
화면 상단에 표시되는 날짜 및 시간을 
설정합니다. 
재설정을 누르면 입력할 수 있습니다. 
한달에 한번 시간 재설정을 통해 보정하는 
것을 권장합니다. 
F1 ~ F5 키의 용도 선택방법은 동일합니다. 
각각의 키를 원하는 용도로 설정하십시오. 
F1 ~ F5 키의 작동제한을 설정합니다. 
ON 시에는 측정 값이 안정된 상태에서만 
동작합니다. 
7) 측정 단위 
8) 터치키 
원하는 단위를 선택하십시오. 
단위를 바꾼다고 해서 측정값이 자동 환산하여 
표시되는 것은 아니므로 유의바랍니다. 
화면터치 오류 방지를 위해 모드 진입과 F키 
동작을 위한 시간을 각각 설정하십시오. 
예) 2초 설정시, 메인화면에서 2초이상 눌러야 
키가 동작합니다. 
24 
AI-850 Weighing Indicator                                            
7.2. 측정 파라미터 
1) 변환 속도 
센서의 변환속도를 선택합니다.  
일반계량에서는 10Hz, 50Hz를 선택하고, 
계측모드에서는 150Hz, 1000Hz, 5000Hz를 
선택하십시오. 
고속은 안정성이 떨어지지만, 낙하실험, 순간값, 홀드값의 경우 참값에 가까워집니다. 
2) LP Filter (로우패스 필터) 
로우패스 필터 차단 주파수를 선택합니다. 숫자가 높아질수록 빨리 표현합니다. 
진동이 많은곳 에서는 숫자를 낮춰 사용하십시오.  
[변환속도 10, 50Hz시]                         
[변환속도 150Hz시] 
[변환속도 1000Hz시]          
[변환속도 2000, 5000Hz시]  
25 
AI-850 Weighing Indicator                                            
3) MA Filter (이동평균 필터) 
이동평균 필터의 샘플링 개수를 선택합니다. 숫자가 낮아질수록 빨리 표현합니다. 
진동이 많은곳 에서는 숫자를 높혀 사용하십시오. 100의 의미는 100개의 Data를 평균내어 
표시한다는 의미입니다. 
[변환속도 10, 50 Hz시]                        
[변환속도 1000 Hz시]                           
[변환속도 150 Hz시] 
[변환속도 2000 Hz시] 
[변환속도 5000 Hz시] 
4) 영점 동작 범위 
5) 영점 트래킹 시간 
영점키의 동작범위를 지정합니다. 
최대중량 대비 영점키 작동범위 %를 지정하면 
영점키나 외부 영점 입력으로 영점이 동작합니다. 
미세한 먼지가 쌓여 영점이 변화하거나 센서의 
부하를 완전히 제거하였는데도 불구하고 
0 점으로 복귀하지 않을 때 자동으로 0점을 잡기 
위한 기능입니다. 영점 트래킹 시간과 트래킹 
폭을 사용하여 적정 값을 입력하십시오.  
26 
AI-850 Weighing Indicator                                            
6) 영점 트래킹 폭 
영점 트레킹 시간과 트레킹 폭을 사용하여 적정 
값을 입력하십시오. 측정 값의 영점 드리프트를 
검출하여 자동으로 영점 보정되는 눈금 폭을 
선택합니다. 
위 예시처럼 영점시간이 0.5 영점 트래킹 폭이 1.0 눈금일때는 0.5초 동안 1.0눈금이 
변화하였을 경우 자동으로 영점으로 처리한다는 의미 입니다. 
7) 안정 검출 시간 
8) 안정 검출 폭 
9) 중량 백업 기능 
선택 하십시오. 
10) 홀드 기능 
안정 램프가 점등되는 시간을 선택합니다. 
안정검출시간동안 안정검출폭 내에서의 변화만 
있으면 안정램프를 켭니다. 
안정 램프가 점등되는 눈금 폭을 선택합니다. 
전원투입 시 초기 영점 동작을 선택합니다. 
OFF 선택시 전원을 투입하면 무조건 0이 됩니다. 
ON 선택시 계량물의 무게가 표시됩니다. 또는 
현재 계측값이 표시됩니다. 
계량모드에서는 ON을 계측모드에서는 OFF를 
홀드 모드를 선택합니다. 
피크홀드 : 최고값만 갱신합니다. 
샘플홀드 : 외부 INPUT 신호나 전면의 홀드키 
입력시만 표시값을 홀드합니다. 
평균홀드 : 평균값을 홀드합니다.  
27 
AI-850 Weighing Indicator                                            
7.3. 시리얼 통신 
1) RS232, RS485 
(1) 통신속도 
(2) 데이터 비트 
(3) 스톱 비트 
(4) 패리티 비트 
시리얼 통신 방식과 통신 장비 번호를 
선택합니다. 
통신 속도를 선택합니다. 
통신 데이터 비트를 선택합니다. 
통신 스톱 비트를 선택합니다. 
통신 패리티 비트를 선택합니다. 
28 
AI-850 Weighing Indicator                                            
(5) 통신 모드 
통신 모드를 선택합니다. 
수동: 전면의 전송키를 누를 때 1회 전송합니다. 
안정시: 측정 값 안정시에 1회 전송합니다. 
판정시: 비교모드에서 판정시 1회 전송합니다. 
실시간: Stream으로 1회/10msec 전송합니다.  
커맨드: Command 명령시 1회 전송합니다. 
시간지정: 설정한 시간 간격마다 전송합니다. 
ModBus: 10 장 ModBus-RTU를 참고하십시오. 
커맨드 수신: 12장 커맨드 수신 모드를 참고하십시오. 
(6) 통신 포맷 
CASKOREA: 22 바이트 
CAS: 22 바이트 
AND: 18 바이트 
Protocol D: 비 접촉 토크센서 전용 21 바이트 
SENS16: 16 바이트 
표시된 숫자의 공백부분 표시 방식은 다음과 같습니다. 
PC 에서는 공백을 PLC는 숫자0 선택을 추천합니다. 
예) Display 에 표시된 숫자가 99라면, 
스페이스  : _ _ _ _ 99 로 전송 ( “_” 는 space 의미) 
숫자 0    :  000099 로 전송 
배선 및 전송 Data Format은 8장 시리얼 인터페이스를 참조하십시오. 
1) 장비 번호 
통신 장비 번호를 선택합니다. 
29 
AI-850 Weighing Indicator                                            
7.4. 프린터 설정 
1) 프린터 
2) 인쇄 모드 
3) 인쇄항목 
인쇄 할 항목을 선택합니다.  
프린터 통신 방식을 선택합니다. 
프린터 인쇄 모드를 선택합니다. 
수동: 인쇄 키로 인쇄합니다. 
안정 시: 숫자 안정 시 자동 인쇄합니다. 
판정 시: 비교 판정 시 자동 인쇄합니다. 
시간지정: 지정된 시간 간격으로 인쇄합니다. 
DATE 
2023-10-13 10:13 
S/N 
00001 
GROSS 
2.57614kg 
TARE 
NET 
1.00000kg 
1.57614kg 
30 
AI-850 Weighing Indicator                                            
4) 용지배출 
7.5. 비교기 설정 
1) 모드 
◆ 출력 릴레이 Table 
인쇄 후, 용지가 배출되는 라인 간격을 
선택합니다. 
비교 제어 모드를 선택합니다. 
9. 외부 입출력 비교기를 참고 하십시오.  
모드 RY1 RY2 RY3 RY4 
샘플링 홀드 
오토 / 수동 피크 홀드 
체커(안정 시만 출력) 
리미트 타입 체커 
리미트 
영점부근 하한 OK 상한 
영점부근 
하한 
4 단 공급 
Final(완료) 
상한 
1 단 공급 2단 공급 3단 공급 4단 공급 
4 단 공급 (영점부근사용) 영점부근 1단 공급 2단 공급 3단 공급 
31 
AI-850 Weighing Indicator                                            
◆ Set-Point 품번 값 입력 방법 
아래 적색 표시 부분의 품번 란을 누르면 입력 창이 표시됩니다. 
OFF 
샘플링 홀드, 오토 피크 홀드, 수동 피크 홀드, 리미트, 체커, 리미트 타입 체커 
4 단 공급 
32 
AI-850 Weighing Indicator                                            
① 샘플링 홀드 모드 - 자동 판정 선택 시 Hold input 시점에서 판정 출력 
◆ 비교제어모드를 [샘플링 홀드]로 선택하고, 홀드판정방식을 [자동]으로 선택하십시오. 
◆ LO/OK/HI 출력은 [출력지연시간]1 후에 ON되고, [출력유지시간]2 후에 OFF됩니다. 
◆ [출력유지시간]을 0으로 하면 지속 출력되며, 리셋 신호로 해제할 수 있습니다. 
주의사항: 출력 유지시간 안에 HOLD INPUT신호를 다시 주지 않도록 유의하십시오. 
◆ 영점 부근 값 이하에서는 동작하지 않습니다. 
◆ 각 판정 시의 값을 전송, 저장 및 인쇄할 수 있습니다.  
기능 선택은 7장 설정 메뉴를 참고하십시오. 
1 [설정 메뉴]-[비교기 설정]-[출력 지연시간] 에서 설정할 수 있습니다. 
2 [설정 메뉴]-[비교기 설정]-[출력 유지시간] 에서 설정할 수 있습니다. 
33 
AI-850 Weighing Indicator                                            
② 샘플링 홀드 모드 - 수동 판정 선택 시 판정 input 시점에서 판정 출력 
◆ 비교제어모드를 [샘플링 홀드]로 선택하고, 홀드판정방식을 [수동]으로 선택하십시오. 
◆ LO/OK/HI 출력은 [출력지연시간]3 후에 ON되고, [출력유지시간]4 후에 OFF됩니다. 
◆ [출력유지시간]을 0으로 설정하면 지속 출력되며, 리셋 신호로 해제할 수 있습니다. 
주의사항: 출력 유지시간 안에 HOLD INPUT신호를 다시 주지 않도록 유의하십시오. 
◆ 영점 부근 값 이하에서는 동작하지 않습니다. 
◆ 각 판정 시의 값을 전송, 저장 및 인쇄할 수 있습니다. 
기능 선택은 7장 설정 메뉴를 참고하십시오. 
3 [설정 메뉴]-[비교기 설정]-[출력 지연시간] 에서 설정할 수 있습니다. 
4 [설정 메뉴]-[비교기 설정]-[출력 유지시간] 에서 설정할 수 있습니다. 
34 
AI-850 Weighing Indicator                                            
③ 오토 피크 홀드 모드 - 영점부근 복귀시 판정 출력 
◆ 비교제어모드를 [오토 피크 홀드]로 선택하십시오. 
◆ 영점 부근 값 이하에서 피크홀드값에 따라 LO/OK/HI 신호가 출력됩니다. 
◆ LO/OK/HI 출력은 [출력지연시간]5 후에 ON되고, [출력유지시간]6 후에 OFF됩니다. 
◆ [출력유지시간]을 0으로 하면 지속 출력되며, 리셋 신호로 해제할 수 있습니다. 
◆ 각 판정 시의 값을 전송, 저장 및 인쇄할 수 있습니다. 
기능 선택은 7장 설정 메뉴를 참고하십시오. 
◆ PLC 동작 순서 
RESET INPUT - 영점 INPUT - PRESS 시작 - 프레스 원위치(영점 부근 값)후 - 판정 
5 [설정 메뉴]-[비교기 설정]-[출력 지연시간] 에서 설정할 수 있습니다. 
6 [설정 메뉴]-[비교기 설정]-[출력 유지시간] 에서 설정할 수 있습니다. 
35 
AI-850 Weighing Indicator                                            
④ 수동 피크 홀드 - 판정 INPUT시에 판정 출력 
◆ 비교제어모드를 [수동 피크 홀드]로 선택하십시오. 
◆ 홀드판정방식을 [수동]으로 선택하면, 위 그래프에서와 같이 외부 판정 INPUT또는 판정 
버튼을 누를 때 LO/OK/HI 신호가 출력됩니다. 
홀드판정방식을 [자동]으로 하면 영점 부근 값 이하에서 LO/OK/HI 신호가 출력됩니다. 
◆ LO/OK/HI 출력은 [출력지연시간]7 후에 ON되고, [출력유지시간]8 후에 OFF됩니다. 
◆ [출력유지시간]을 0으로 하면 지속 출력되며, 리셋 신호로 해제할 수 있습니다. 
◆ 각 판정 시의 값을 전송, 저장 및 인쇄할 수 있습니다. 
기능 선택은 7장 설정 메뉴를 참고하십시오. 
◆ PLC 순서 
RESET INPUT - 영점 INPUT- PRESS 시작 - HOLD INPUT - 판정INPUT – 판정 
7 [설정 메뉴]-[비교기 설정]-[출력 지연시간] 에서 설정할 수 있습니다. 
8 [설정 메뉴]-[비교기 설정]-[출력 유지시간] 에서 설정할 수 있습니다. 
36 
AI-850 Weighing Indicator                                            
⑤ 리미트 모드 - 실시간 출력 (단, FINAL은 상한 값 이상 안정 시에 출력) 
◆ 비교제어모드를 [리미트]로 선택하십시오. 
◆ LO/FINAL/HI 출력은 [출력지연시간] 및 [출력유지시간]과 관계없이 측정 값에 연동 되어 
출력됩니다. 
◆ HIGH 설정 값 이상에서 안정일 때 FINAL 출력(RY3)이 ON됩니다. 
◆ 낙차9를 설정했을 때에는 [HIGH 설정 값 – 낙차 값]에서 HI 출력(RY4)이 ON됩니다. 
◆ 영점 부근 값 이하에서는 동작하지 않습니다. 
◆ 위 그래프는 접점 출력 형태를 A점접으로 지정했을 때 그래프이며 B접점 그래프로  
지정했을 때는 영점 부근을 제외하고 접점의 ON, OFF 상태가 반전됩니다. 
◆ 각 판정 시의 값을 전송, 저장 및 인쇄할 수 있습니다. 
◆ 프레스 PLC 순서: RESET INPUT - 영점 INPUT - PRESS 시작 - 연속 판정 
충진/투입 PLC 순서: RESET INPUT - 영점 INPUT - 충진 또는 투입 시작 - 연속 판정 
9 [설정 메뉴]-[비교기 설정]-[낙차값] 에서 설정할 수 있습니다. 
37 
AI-850 Weighing Indicator                                            
⑥ 체커모드 - 영점부근 이상에서 측정 값 안정 시에 판정 출력 
◆ 비교제어모드를 [체커]로 선택하십시오. 
◆ LO/OK/HI 출력은 [출력지연시간]10 후에 ON되고, [출력유지시간]11 후에 OFF됩니다. 
◆ [출력유지시간]을 0으로 하면 지속 출력되며, 리셋 신호로 해제할 수 있습니다. 
◆ 영점 부근 값 이하에서는 동작하지 않습니다. 
◆ 위 그래프는 접점 출력 형태를 A점접으로 지정했을 때 그래프이며 B접점 그래프로 
지정했을 때는 영점 부근을 제외하고 접점의 ON, OFF 상태가 반전됩니다. 
◆ 각 판정 시의 값을 전송, 저장 및 인쇄할 수 있습니다. 
기능 선택은 7장 설정 메뉴를 참고하십시오. 
◆ PLC 순서: 영점 INPUT - 계량 시작 - 안정 시 판정 
10 [설정 메뉴]-[비교기 설정]-[출력 지연시간] 에서 설정할 수 있습니다. 
11 [설정 메뉴]-[비교기 설정]-[출력 유지시간] 에서 설정할 수 있습니다. 
38 
AI-850 Weighing Indicator                                            
⑦ 리미트 타입 체커 모드 - 실시간 판정 출력 
◆ 비교제어모드를 [리미트 타입 체커]로 선택하십시오. 
◆ LO/OK/HI 출력은 [출력지연시간] 및 [출력유지시간]과 관계없이 측정 값에 연동되어 
출력됩니다. 
◆ 영점 부근 값 이하에서는 동작하지 않습니다. 
◆ 위 그래프는 접점 출력 형태를 A점접으로 지정했을 때 그래프이며 B접점 그래프로   
지정했을 때는 영점 부근을 제외하고 접점의 ON, OFF 상태가 반전됩니다 
◆ 각 판정 시의 값을 전송, 저장 및 인쇄할 수 있습니다. 
기능 선택은 7장 설정 메뉴를 참고하십시오. 
◆ PLC 순서 
영점 INPUT - 계량 시작 - 연속 판정 
39 
AI-850 Weighing Indicator                                            
⑧ 4단 공급 모드 
◆ 비교제어모드를 [4단 공급]으로 선택하십시오. 
◆ LL 값을 0으로 설정하면, LL 출력은 영점 부근 출력으로 동작합니다. 
◆ LL/LO/HI/HH 출력은 [출력지연시간]12 및 [출력유지시간]13과 관계없이 측정 값에 연동 
되어 출력됩니다. 
◆ 낙차14를 설정했을 때에는 [HH 설정 값 – 낙차 값]에서 HH 출력(RY4)이 ON됩니다. 
◆ 영점 부근 값 이하에서는 동작하지 않습니다. 
◆ 위 그래프는 접점 출력 형태를 A점접으로 지정했을 때 그래프이며 B접점 그래프로 
지정했을 때는 영점 부근을 제외하고 접점의 ON, OFF 상태가 반전됩니다. 
◆ 각 판정 시의 값을 전송, 저장 및 인쇄할 수 있습니다. 
기능 선택은 7장 설정 메뉴를 참고하십시오. 
◆ 프레스 PLC 순서: RESET INPUT - 영점 INPUT - PRESS 시작 - 연속 판정 
충진/투입 PLC 순서: RESET INPUT - 영점 INPUT - 충진 또는 투입 시작 - 연속 판정 
12 [설정 메뉴]-[비교기 설정]-[출력 지연시간] 에서 설정할 수 있습니다. 
13 [설정 메뉴]-[비교기 설정]-[출력 유지시간] 에서 설정할 수 있습니다. 
14 [설정 메뉴]-[비교기 설정]-[낙차값] 에서 설정할 수 있습니다. 
40 
AI-850 Weighing Indicator                                            
2) 영점 부근 값 
3) 낙차 값 
4) 출력 접점 
5) 출력 지연시간 
6) 출력 유지시간 
영점 부근 값을 설정합니다.  
영점부근 값에서는 영점으로 판단하여 영점 신호 
외에 아무런 출력도 하지 않습니다. 
영점부근값내에서는 Display값이 “0”으로 
고정됩니다. 
리미트 모드의 HI출력은 [HI설정 값 – 낙차 
값]에서 출력되고, 4단공급 모드의 HH출력은 
[HH 설정 값 - 낙차 값]에서 출력됩니다. 
리미트 모드, 리미트 체커 모드, 4단공급모드는 
A/B 접점을 선택할 수 있습니다. 
출력 지연시간 이후에 해당 외부 출력이 
ON됩니다. 단, 리미트 모드, 리미트 타입 체커 
모드에서는 동작 하지 않으며, 개별 관리를 
ON하면 OK 및 하한 출력 지연 시간을 각각 
입력할 수 있습니다. 
외부 출력이 ON되고, 출력 유지시간 이후에 
해당 외부 출력이 OFF됩니다. 단, 리미트 모드, 
리미트 타입 체커 모드에서는 동작 하지 않으며, 
개별 관리를 ON하면 OK 및 하한 출력 유지 
시간을 각각 입력할 수 있습니다. 
41 
AI-850 Weighing Indicator                                            
7) IN1~IN4 
7.6. BCD 출력 
1) 데이터 로직 
2) 완료신호 유지 
3) 자릿수 변환지연 
기능입니다. 
외부 INPUT1 ~INPUT4 접점의 용도를 
설정합니다. 
전송, 인쇄는 외부 통신기기(프린터, PC)로 
DATA를 전송합니다. 
BCD 출력 데이터의 로직을 선택합니다. 
Busy 신호가 Low로 유지되는 시간을 
선택합니다. 
자릿수가 변할 때 지연 시간 후에 BCD 신호가 
출력 됩니다. 
예를 들어, 표시 값이 4자리숫자 9999에서 1이 
증가 하여 5자리(10000)로 변경될 때 순간적으로 
19999 로 인식되는 것을 방지하기 위한 
42 
AI-850 Weighing Indicator                                            
BCD 출력 결선 방법 
BCD출력은 측정 값을 BCD코드로 변환하고 오픈 컬렉터 방식으로 출력하는 인터페이스 
입니다. 
(예: 측정 값 3782의 경우, 0000 0000 0011 0111 1000 0010 으로 전송) 
내부 회로는 외부 회로와 전기적 절연되어 있어 외부 노이즈에 영향을 받지 않습니다. 
최대 전압 DC 80V, 최대 전류 50mA 이내의 신호선을 연결하시기 바랍니다. 
◆ 신호 출력 타이밍 
◆ 커넥터 핀 배열 (D-SUB 37P male) 
1 COM 
14 1 x 103 
27 Busy signal(Data Change) 
2 1 x 100 
15 2 x 103 
28 소수점 1 아래 표 참조 
3 2 x 100 
16 4 x 103 
29 소수점 2 아래 표 참조 
4 4 x 100 
17 8 x 103 
30 소수점 4 아래 표 참조 
5 8 x 100 
6 1 x 101 
18 1 x 104 
31 HOLD Lamp 
19 2 x 104 
7 2 x 101 
32 NET Lamp 
20 4 x 104 
8 4 x 101 
33 OVER Lamp 
21 8 x 104 
9 8 x 101 
34 NC 
22 1 x 105 
10 1 x 102 
35 NC 
23 2 x 105 
11 2 x 102 
36 NC 
24 4 x 105 
12 4 x 102 
37 NC 
25 8 x 105 
13 8 x 102 
 
26 High: +극성, Low: -극성  
Decimal Digit 
BCD CODE 
4 
2 
1 
Point 
0 
0 
0 
1 
0 
0 
0 
0 
3 
0 
1 
0.0 
1 
3 
0 
0 
0.00 
1 
4 
1 
1 
0.000 
0 
5 
1 
0 
0.0000 
0 
1 
43 
0.00000 
AI-850 Weighing Indicator                                            
7.7. 아날로그 출력 
1) 출력 모드 
2) 최대 출력값 
3) 최소값 보정 
아날로그 출력 모드를 선택합니다  
아날로그 출력 속도는 ADC 변환 속도와 연동하여 
출력됩니다. (최대 5KHz) 
아날로그 최대 출력에 해당하는 값을 설정합니다. 
설정한 값에서 아날로그 최대값을 출력합니다. 
아날로그 출력의 최소값을 조정합니다. 
0V, -5V, -10V, 0mA, 4mA 값을 보정하는 
기능입니다. 
후면 패널의 AOUT, AGND 포트를 멀티미터로 
측정 하면서 일반조정과 미세조정의 -, + 키로 
최소값을 실시간 보정하십시오. 일반 조정의 -, + 키를 길게 누르면 빠르게 변합니다. 
4) 최대값 보정 
아날로그 출력의 최대값을 조정합니다. 
5V, 10V, 20mA, 24mA 의 값을 보정하는 
기능입니다. 
후면 패널의 AOUT, AGND 포트를 멀티미터로 
측정 하면서 일반조정과 미세조정의 +, - 키로 
최대값을 실시간 보정하십시오. 일반 조정의 -, + 키를 길게 누르면 빠르게 변합니다. 
44 
AI-850 Weighing Indicator                                            
DAC 출력 결선 방법 
측정 값을 전류 또는 전압으로 변환하여 아날로그 값으로 출력하는 인터페이스입니다. 
설정모드에서 전류 또는 전압 출력의 선택이 가능하며 동시 출력은 되지 않습니다. 
Resolution: 16 bits / Voltage TUE: ±0.01%FSR, Current TUE: ±0.02%FSR  
연결단자 
16 
DAC  
Analog out 
22 
COM 
45 
AI-850 Weighing Indicator                                            
7.8. 이더넷 설정 
1) DHCP 
2) 수동 IP  
3) 통신 방식  
4) 서버 IP 
5) 포트 번호 
DHCP는 네트워크 기기가 자동으로 IP 주소를 
할당 받는 프로토콜입니다. DHCP ON시 
네트워크에서 자동으로 IP 주소를 받습니다. 
수동 IP설정은 사용자가 직접 IP 주소, 서브넷 
마스크, 게이트웨이를 입력하여 네트워크에 
연결하는 방법입니다.  
DHCP가 OFF일 때 동작합니다. 
이더넷 통신 방식을 설정합니다. 
이더넷 통신 방식이 클라이언트 모드일 경우, 
통신 대상의 IP주소를 서버 IP주소로 설정하세요. 
이더넷 통신에 사용될 포트 번호를 설정합니다. 
46 
AI-850 Weighing Indicator                                            
6) 모드 
통신 모드를 선택합니다. 
수동: 전면의 전송키를 누를 때 1회 전송합니다. 
안정시: 측정 값 안정시에 1회 전송합니다. 
판정시: 비교모드에서 판정시 1회 전송합니다. 
실시간: Stream으로 1회/10msec 전송합니다.  
커맨드: Command 명령시 1회 전송합니다. 
시간지정: 설정한 시간 간격마다 전송합니다. 
ModBus: 11 장 ModBus-TCP를 참고하십시오. 
7) 통신 포맷 
CASKOREA: 22 바이트 
CAS: 22 바이트 
AND: 18 바이트 
Protocol D: 비 접촉 토크센서 전용 21 바이트 
SENS16: 16 바이트 
표시된 숫자의 공백부분 표시 방식은 다음과 같습니다. 
PC 에서는 공백을 PLC는 숫자0 선택을 추천합니다. 
예) Display 에 표시된 숫자가 99라면, 
스페이스  : _ _ _ _ 99 로 전송 ( “_” 는 space 의미) 
숫자 0    :  000099 로 전송 
포맷은 시리얼 통신의 포맷과 동일합니다.  
8) 통신 정보 
현재 이더넷 통신에 대한 정보를 확인할 수 
있습니다. 
47 
AI-850 Weighing Indicator                                            
 
 
48 
8. 시리얼 인터페이스 
RS-232C 및 RS-485(half duplex)는 전기적인 노이즈에 민감하므로, 전원선을 비롯한 
전기배선들과 별로도 분리하여 배선하고 반드시 쉴드 케이블을 사용하시기 바랍니다. 
시리얼 인터페이스 방식 선택은 설정 메뉴를 참고하십시오. 
 내부 회로는 외부 회로와 전기적 절연되어 있어 외부 노이즈에 영향을 받지 않습니다. 
  
◆ RS-485 통신 접속  
 접속 케이블은 실드가 있는 트위스트 페어 선을 사용하여 주십시오.  
 RS-485 통신시 배선 양단에 종단 저항을 장착하여 주십시오.  
 일반적으로 100Ω~120Ω을 사용하며, 환경에 따라 다를 수 있습니다.  
 
 
 
8.1. 전송 데이터 포맷 
◆ CASKOREA Format (22 byte) 
 
HEX ASCII (XOR CRC range) ASCII HEX 
STX 장비번호  H1  H2  측정 데이터  단위 CRC ETX 
0x02 9 9 , 3 , 램프상태 , +     0 . 0 , 2 9 F F 0x03 
 
[H1 : 측정 값 상태 Header] 
H1 안정 불안정 오버로드 홀드 LO OK HI 
코드 0 1 2 3 4 5 6 
 
 시리얼 통신 모드가 [판정 시]일 때 2,4,5,6번 그 외 모드는 0,1,2,3번이 동작합니다. 
단자 RS-232C 
1 TXD 
2 RXD 
3 Serial GND 
단자 RS-485 
3 Serial GND 
4 485-A 
5 485-B 
AI-850 Weighing Indicator                                            
 
 
49 
[H2 : 램프 상태 Header] 
H2 Bit7 Bit6 Bit5 Bit4 Bit3 Bit2 Bit1 
상태 1 Stable 1 Hold 1 Net Tare 
 
[단위코드표 : 측정 값 단위] 
Unit null g kg ton lb N kN Pa kPa MPa Bar mm kgf kgf*cm kgf*m 
코드 1st 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 
코드 2nd 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 
 
Unit N*cm N*m KN*m mmHg mmH2O m/s2 kgf/cm2 lb*in mN 
코드 1st 1 1 1 1 1 2 2 2 2 
코드 2nd 5 6 7 8 9 0 1 2 3 
 
◆ CAS Format (22 byte) 
 
  H1     H2  
장비번호      측정 데이터        단위 종료문자 
 
S T , G S ,   ,      0 . 0  0 2 CR LF 
 
                램프 상태 
  
H1 
ST 안정 (0x53) (0x54) 
US 불안정 (0x55) (0x53) 
OL 오버로드 (0x4F) (0x4C) 
HD 홀드 (0x48) (0x44) 
H2 
GS 총 중량 (0x47) (0x53) 
NT 순 중량 (0x4E) (0x54) 
장비 번호 
장비 번호는 다수의 장비를 사용할 때 장비 구분을 위해 사용 됩니다. 
장비 번호는 설정모드에서 지정할 수 있습니다. 
램프 상태 
Bit7 Bit6 Bit5 Bit4 Bit3 Bit2 Bit1 Bit0 
1 Stable 1 Hold 1 Net Tare Zero 
측정 데이터 
예 1) 13.5kg  ‘ ’, ‘ ’, ‘ ’, ‘ ’, ‘1’, ‘3’, ‘.’, ‘5’ 
예 2) 135kg    
‘ ’, ‘ ’, ‘ ’, ‘ ’, ‘1’, ‘3’, ‘5’, ‘ ’ 
예 3) -13.5kg  
‘-’, ‘ ’, ‘ ’, ‘ ’, ‘1’, ‘3’, ‘.’, ‘5 ’ 
단위 CASKOREA format의 단위코드표의 코드로 전송됩니다. 
종료 문자 CR LF (0x0D) (0x0A) 
AI-850 Weighing Indicator                                            
◆ AND Format (18 byte) 
H1       
H2            
측정 데이터       단위 종료문자 
S T , G S , + 0 0 0 0 0 . 0 0 2 CR LF 
ST 
안정 (0x53) (0x54) 
US 
불안정 (0x55) (0x53) 
H1 
OL 
오버로드 (0x4F) (0x4C) 
HD 
홀드 (0x48) (0x44) 
GS 
H2 
총 중량 (0x47) (0x53) 
NT 
측정 데이터 
순 중량 (0x4E) (0x54) 
예 1) 13.5kg  ‘+’, ‘ ’, ‘ ’, ‘ ’, ‘1’, ‘3’, ‘.’, ‘5’ 
예 2) 135kg    
‘+’, ‘ ’, ‘ ’, ‘ ’, ‘ ’, ‘1’, ‘3’, ‘5’ 
예 3) -13.5kg  
‘-’, ‘ ’, ‘ ’, ‘ ’, ‘1’, ‘3’, ‘.’, ‘5 ’ 
단위 CASKOREA format의 단위코드표의 코드로 전송됩니다. 
종료 문자 CR LF (0x0D) (0x0A) 
◆ Protocol D Format (21 byte) 예) 장비 번호 1 현재 값: +123.45 일 경우 
STX ID Length CODE Channel 
Data 
CheckSum ETX 
ASCII ㄱ 0 1 0 A D 0 1 
HEX  0x02 0x30 0x31 0x30 0x45 0x44 0x30 0x31 
아래 참조 
6 3 ㄴ 
0x36 
0x33 0x03 
Data(10 Byte) 
Index (2Byte) 
측정값Data (8byte) 
ASCII 
0 
0 
+ 
0 
1 
2 
3 
. 
4 
5 
HEX  
0x30 
0x30 
0x2B 
0x30 
0x31 
◆ SENS16 Format (16 byte) 
장비번호             
측정 데이터      종료문자 
I 
0x32 
D 0 0 1 , + 0 0 0 0 0 . 0 CR LF 
0x33 
0x2E 
0x34 
0x35 
측정 데이터 
장비번호 ID (0x49) (0x44) + 장비번호 ASCII 3 바이트 
예 1) 13.5kg  ‘+’, ‘ ’, ‘ ’, ‘ ’, ‘1’, ‘3’, ‘.’, ‘5’ 
예 2) 135kg    
‘+’, ‘ ’, ‘ ’, ‘ ’, ‘ ’, ‘1’, ‘3’, ‘5’ 
예 3) -13.5kg  
‘-’, ‘ ’, ‘ ’, ‘ ’, ‘1’, ‘3’, ‘.’, ‘5 ’ 
종료 문자 CR LF (0x0D) (0x0A) 
50 
AI-850 Weighing Indicator                                            
 
 
51 
8.2. 커맨드 전송 포맷 
본 장비를 외부기기에서 조작하고자 할 때 커맨드 모드를 사용할 수 있습니다. 
◆ 커맨드 1 
코드 시작 장비 번호  커맨드 종료 전송 예제 
ASCII ㄱ 0 1 , 
자릿수 가변 코드 
ㄴ 02 01, MF 03 
HEX 02 30 31 2C 03 02 30 31 2C 4D 46 03 
 장비 번호를 사용하지 않는 경우, 장비 번호와 구분 기호(,)는 제외할 수 있습니다. 
기능 커맨드 (괄호 안은 HEX) 인디케이터 응답 
측정 값 요청 MF (4D 46) 설정된 전송 포맷으로 PC전송 
영점 입력 MZ (4D 5A) 
Echo응답,OK(NG) 
홀드 입력 MH (4D 48) 
리셋 입력 MR (4D 52) 
용기 입력 MT (4D 54) 
총중량 입력 MG (4D 47) 
순중량 입력 MN (4D 4E) 
인쇄 입력 MP (4D 50) 
판정 입력 MJ (4D 4A) 
G/N 입력 MS (4D 53) 
현재 품번 변경 S01 (53 30 31)  
* 품번 1로 변경 
RY1~RY4설정 
S01,1,0.2 
(53 30 31 2C 31 2C 30 2E 32) 
* 품번1의 RY1 값 0.2 설정 
품번 코드 읽기 RS (52 53) S02 * 현재 품번 2 
RY1~RY4 읽기 R01,1 (52 30 31 2C 31) 
* 품번1의 RY1 값 요청 
S01,1,0.2 
* 품번 1의 RY1 값 0.2 
비교기 상태 RC (52 43) 예) C0010,1000   
* RY3 ON, IN1 ON 
날짜 및 시간 설정 
G23,07,14,11,11 
(47 32 33 2C 30 37 2C 31 34 
2C 31 31 2C 31 31) 
* 2023년 07월 14일  
11시 11분으로 설정 
 
 
AI-850 Weighing Indicator                                            
 
 
52 
◆ 커맨드 2 
코드 시작 장비 번호 커맨드 종료 전송 예제 
ASCII STX 0 1 동작(R or W)+ 
자릿수 가변 코드 
ETX 01RCWT 
HEX 02 30 31 03 02 30 31 52 43 57 54 03 
 
READ COMMAND 
기능 
커맨드  
(괄호 안은 HEX) 
인디케이터 응답 
측정 값 요청 RCWT (52 43 57 54) 
ASCII 01RCWTSTNT+00027.602 
HEX 02 30 31 52 43 57 54 53 54 4E 54 2B 30 30 
30 32 37 2E 36 30 32 03 
STX(1) ID(2) 명령어(4) 상태1(2) 상태2(2) 부호(1) 
중량(소숫점포함)(7) 단위(2) ETX(1) = 총 22BYTE 
 
상태1: OL(오버로드), ST(안정), US(불안정) 
상태2: NT(실중량), GS(총중량) 
 
단위: 카스코리아포맷의 단위 코드표의 코드로 전송됩니다. 
품번 요청 RPNO (52 50 4E 4F) 
ASCII 01RPNO01 
HEX 02 30 31 52 50 4E 4F 30 31 03 
품번이 01일 경우 
키 용기 값 요청 RTAR (52 54 41 52) 
ASCII 01RTAR0000500 
HEX 02 30 31 52 54 41 52 30 30 30 30 35 30 30 
03 
키 용기 값이 500일 경우 
SP1 요청 RSP1 (52 53 50 31) 
ASCII 01RSP1001000 
HEX 02 30 31 52 53 50 31 30 30 31 30 30 30 03 
SP1값이 1000일 경우 
 
<비교기 모드 별 동작> 
4단공급모드에서 SP1는 LL입니다. LL이 0인 경우 영점부근 
값을 불러옵니다. 
OFF시 동작하지 않습니다. 
그 밖의 모드에서 SP1는 LO 입니다. 
SP2 요청 RSP2 (52 53 50 32) 
ASCII 01RSP2002000 
HEX 02 30 31 52 53 50 32 30 30 32 30 30 30 03 
SP2값이 2000일 경우 
 
<비교기 모드 별 동작> 
4단공급모드에서 SP2는 LO입니다. 
OFF시 동작하지 않습니다. 
그 밖의 모드에서 SP2는 HI 입니다. 
AI-850 Weighing Indicator                                            
ASCII 
01RSP3003000 
HEX 02 30 31 52 53 50 33 30 30 33 30 30 
30 03 
SP3 요청 
RSP3 (52 53 50 33) 
SP3 값이 3000일 경우 
<비교기 모드 별 동작> 
4 단공급모드에서 SP3는 HI입니다. 
그 밖의 모드에서는 동작하지 않습니다. 
ASCII 
01RSP4004000 
HEX 02 30 31 52 53 50 34 30 30 34 30 30 
30 03 
SP4 요청 
RSP4 (52 53 50 34) 
SP4 값이 4000일 경우 
<비교기 모드 별 동작> 
4 단공급모드에서 SP4는 HH입니다. 
그 밖의 모드에서는 동작하지 않습니다. 
53 
AI-850 Weighing Indicator                                            
 
 
54 
WRITE COMMAND 
성공(ACK : 06), 실패(NAK : 15) 
영점 입력 WZER (57 5A 45 52) ASCII 01WZER 
HEX 02 30 31 57 5A 45 52 06 03 
 
홀드 입력 WHOL (57 48 4F 4C) ASCII 01WHOL 
HEX 02 30 31 57 48 4F 4C 06 03 
 
홀드 리셋 입력 WHRS (57 48 52 53) ASCII 01WHRS 
HEX 02 30 31 57 48 52 53 06 03 
 
용기 입력 WTAR (57 54 41 52) ASCII 01WTAR 
HEX 02 30 31 57 54 41 52 06 03 
 
용기 리셋 입력 WTRS (57 54 52 53) ASCII 01WTRS 
HEX 02 30 31 57 54 52 53 06 03 
 
품번 변경 입력 WPNO01 (품번 01번설정) 
(57 50 4E 4F 30 31) 
ASCII 01WPNO 
HEX 02 30 31 57 50 4E 4F 06 03 
 
SP1값 변경 
입력 
WSP1000200 
(57 53 50 31 30 30 30 32 
30 30 03) 
ASCII 01WSP1 
HEX 02 30 31 57 53 50 31 06 03 
<비교기 모드 별 동작> 
4단공급모드에서 SP1는 LL입니다. 
OFF시 동작하지 않습니다. 
그 밖의 모드에서 SP1는 LO 입니다. 
SP2값 변경 
입력 
WSP2000400 
(57 53 50 32 30 30 30 34 
30 30 03) 
ASCII 01WSP2 
HEX 02 30 31 57 53 50 32 06 03 
<비교기 모드 별 동작> 
4단공급모드에서 SP2는 LO입니다. 
OFF시 동작하지 않습니다. 
그 밖의 모드에서 SP2는 HI 입니다. 
SP3값 변경 
입력 
WSP3000600 
(57 53 50 33 30 30 30 36 
30 30 03) 
ASCII 01WSP3 
HEX 02 30 31 57 53 50 33 06 03 
<비교기 모드 별 동작> 
4단공급모드에서 SP3는 HI입니다. 
그 밖의 모드에서는 동작하지 않습니다. 
SP4값 변경 
입력 
WSP4000800 
(57 53 50 34 30 30 30 38 
30 30 03) 
ASCII 01WSP4 
HEX 02 30 31 57 53 50 34 06 03 
<비교기 모드 별 동작> 
4단공급모드에서 SP4는 HH입니다. 
그 밖의 모드에서는 동작하지 않습니다. 
  
AI-850 Weighing Indicator                                            
9. 외부 입출력 비교기 
9.1. 외부 입력 결선 
외부 입력 단자를 공통 GND단자와 단락 또는 포토커플러를 통한 통전 시 동작 하며, 각 
단자의 용도는 설정모드에서 선택 가능합니다. (영점, 홀드, 리셋, 전송, 판정) 
내부 회로는 외부 회로와 전기적 절연되어 있어 외부 노이즈에 영향을 받지 않습니다. 
9.2. 외부 출력 결선 
외부 출력은 오픈컬렉터이며, 포토커플러 또는 릴레이를 이용하여 접속하십시오. 
출력 단자의 최대 부하는 AC/DC 350V, 120mA입니다. 
내부 회로는 외부 회로와 전기적 절연되어 있어 외부 노이즈에 영향을 받지 않습니다. 
55 
AI-850 Weighing Indicator                                            
10. ModBus-RTU 
RS-485 통신 환경에서 동작하기 위한 모드버스 프로토콜의 한 종류로 장치 ID를 통하여 
각 장치를 구분하고 CRC를 이용하여 에러를 확인하여 통신하는 프로토콜입니다. 
데이터 주소를 정확히 지정된 범위 내에서 읽고 쓰는 방식으로 동작하며, 주소의 중간 
부분을 임의로 읽거나 쓰는 것은 불가능합니다.  
◆ Function Codes 
Function code 03h : Read Holding Registers 
Function code 06h : Write Single Registers 
Function code 10h : Write Multiple Registers 
◆ Data 
주소 
(HEX) 
주소 
(DEC) 
길 
이 
R/W 
설명  
길 
주소 
(HEX) 
주소 
(DEC) 
00h 
0 
이 
R/W 
설명 
2 RO 최대 표시  3Ch 60 2 RW 날짜 
02h 
2 
1 RO 최소 눈금  3Eh 62 2 RW 시간 
03h 
3 
1 RO 소수점 위치  40h 64 1 WO 외부 입력 명령 
04h 
4 
2 RO AD 변환 값  
41h 
06h 
6 
2 RO 
측정 값  
65 
1 RW 
품번 
42h 
08h 
8 
66 
2 RW RY1 설정 값 
1 RO 램프 상태  44h 68 2 RW RY2 설정 값 
09h 
9 
1 RO 에러 데이터  46h 70 2 RW RY3 설정 값 
0Ah 
10 
20 - 
Reserved  
48h 
1Eh 
30 
72 
2 RW RY4 설정 값 
1 RO 비교기 모드  4Ah 74 26 - Reserved 
1Fh 
31 
2 RO 외부 입출력 상태       
21h 
33 
27 - 
RO: 읽기 전용, WO: 쓰기 전용, RW: 읽기 쓰기 
Reserved       
56 
AI-850 Weighing Indicator                                            
[ 램프 상태 맵 ] 
8bit 
7bit 
6bit 
5bit 
4bit 
안정 
3bit 
2bit 
1bit 
순중량 총중량 홀드 영점 
[ 에러 데이터 맵 ] 
8bit 
7bit 
6bit 
5bit 
4bit 
오버 로드       
3bit 
2bit 
1bit 
센서 에러 
[ 비교기 모드 맵 ] 
0 
1 
2 
OFF 
3 
샘플링 홀드 오토 피크 홀드 수동 피크 홀드 
4 
체커 
5 
6 
7   
리미트 타입 체커 
리미트 
[ 외부 입 출력 ] 
16bit 
15bit 
14bit 
4 단 공급   
13bit 
12bit 
RY4 
11bit 
RY3 
10bit 
9bit 
RY2 
8bit 
7bit 
6bit 
5bit 
4bit 
RY1 
IN4 
3bit 
2bit 
1bit 
IN3 
[ 외부 입력 명령 ] 
1 
2 
3 
IN2 
IN1 
영점 
4 
홀드 
리셋 
5 
판정 
6 
7 
8 
용기 
총중량/순중량 
9 
총중량 
10 
순중량 
57 
전송 
인쇄 
AI-850 Weighing Indicator                                            
 
 
58 
① 쓰기(Write Multiple Registers) 
 
Slave Address Starting Address Number of Register 
01h 65h 09h 
 
예제 : 4단 공급 비교 모드 설정값 쓰기 
품번: 01, LL : 250, LO : 500, HI : 750, HH : 1000 
 
Request  Response 
Field Name Hex  Field Name Hex 
Slave Address (Device ID) 01h  Slave Address (Device ID) 01h 
Function 10h  Function 10h 
Starting Address High 00h  Starting Address High 00h 
Starting Address Low 41h  Starting Address Low 41h 
Number of Register High 00h  Number of Register High 00h 
Number of Register Low 09h  Number of Register Low 09h 
Byte Count 12h  CRC Code High XXh 
Set-Point code High 00h  CRC Code Low XXh 
Set-Point code Low 01h    
RY1 value High 00h    
RY1 value High 00h    
RY1 value Low 00h    
RY1 value Low FAh    
RY2 value High 00h    
RY2 value High 00h    
RY2 value Low 01h    
RY2 value Low F4h    
RY3 value High 00h    
RY3 value High 00h    
RY3 value Low 02h    
RY3 value Low EEh    
RY4 value High 00h    
RY4 value High 00h    
RY4 value Low 03h    
RY4 value Low E8h    
CRC Code High XXh    
CRC Code Low XXh    
 
		
AI-850 Weighing Indicator                                            
② 읽기 (Read Holding Registers) 
예제 1: 측정값 읽기 
Slave Address 
Starting Address 
01h 
Number of Register 
06h 
Request  
02h (2) 
Response 
Field Name 
Hex  
Slave Address (Device ID) 01h  
Field Name 
Slave Address (Device ID) 
Hex 
Function 
01h 
03h  
Function 
Starting Address High 
03h 
00h  
Byte Count 
Starting Address Low 
04h 
06h  
Measured value High 
Number of Register High 
00h 
00h  
Measured value High 
Number of Register Low 
00h 
02h  
Measured value Low 
CRC Code High 
03h 
24h  
Measured value Low 
CRC Code Low 
E8h 
0Ah  
CRC Code High 
CRC Code Low 
XXh 
XXh 
59 
AI-850 Weighing Indicator                                            
 
 
60 
예제 2: 최대 표시 ~ 에러데이터 읽기 
Slave Address Starting Address Number of Register 
01h 00h 0Ah (10) 
 
Request  Response 
Field Name Hex  Field Name Hex 
Slave Address (Device ID) 01h  Slave Address (Device ID) 01h 
Function 03h  Function 03h 
Starting Address High 00h  Byte Count 14h 
Starting Address Low 00h  Maximum capacity High 00h 
Number of Register High 00h  Maximum capacity High 00h 
Number of Register Low 0Ah  Maximum capacity Low 0Bh 
CRC Code High C5h  Maximum capacity Low B8h 
CRC Code Low CDh  Minimum division High 00h 
   Minimum division Low 01h 
   Decimal point High 00h 
   Decimal point Low 00h 
   ADC value High 00h 
   ADC value High 02h 
   ADC value Low 78h 
   ADC value Low F5h 
   Measured value High 00h 
   Measured value High 00h 
   Measured value Low 03h 
   Measured value Low E8h 
   Lamp status High 00h 
   Lamp status Low 10h 
   Error data High 00h 
   Error data Low 00h 
   CRC Code High XXh 
   CRC Code Low XXh 
 
  
AI-850 Weighing Indicator                                            
11. ModBus-TCP 
ModBus-TCP 는 TCP/IP 네트워크를 기반으로 하는 ModBus 프로토콜의 한 종류이며, 
Ethernet 네트워크에서 동작합니다.  
소켓은 하나만 지원합니다. 
ModBus-TCP 프레임 구조 
MBAP Header 
Function code 
Transaction 
ID 
Data 
Protocol ID 
Length 
Unit ID 
Function code 
ModBus-TCP 프레임 구조 
ModBus-TCP 는 MBAP를 선두로 Function code, Data 순으로 이루어져 있습니다. 
MBAP는 총 7Byte이고 아래와 같은 내용의 Byte값을 나타냅니다. 
Transaction 
ID [2Bytes] 
Protocol ID 
[2Bytes] 
Client 가 0x0000 값부터 1씩 증가시키며  
Server 는 이 값을 그대로 복사하여 사용합니다. 
Data 
0x0000 으로 고정 값을 사용합니다. 
Length 
[2Bytes] 
Unit ID 부터 Data 끝까지의 Byte 수를 나타냅니다. 
Unit ID 
[1Bytes] 
0x01 로 고정 값을 사용합니다. 
Function code, Data 는 ModBus_RTU 와 동일합니다.  
10 장 ModBus-RTU (CRC 제외) 를 참고하시기바랍니다. 
61 
AI-850 Weighing Indicator                                            
12. 커맨드 수신 모드 
커맨드 수신 모드는 보조 디스플레이로 사용하기 위한 시리얼 모드입니다. 
비교기모드는 개별적으로 동작합니다. 
1) 하드웨어 연결 
AI-850(본 제품)과 AI-850(보조 디스플레이)의 RS232포트를 다음과 같이 1대1로 
연결합니다. 
마스터 (본 제품) 
TXD 
클라이언트 (보조 디스플레이) 
RXD 
RXD 
GND 
TXD 
GND 
2) 통신 설정 
RS232 설정 데이터 
마스터 
통신 모드 
커맨드 
클라이언트 
커맨드 수신 
양쪽 장치의 통신 설정(통신 속도, 데이터 비트, 스톱비트, 패리티)은 동일하게 
설정합니다.  
클라이언트가 커맨드 수신모드를 선택하면 시리얼 포맷이CASKOREA Format으로 
설정되며, 설정 동기화 시 마스터의 시리얼 포맷도 CASKOREA Format으로 
설정됩니다. 
3) 클라이언트 명령 동작 
클라이언트의 영점, 용기, 총중량, 순중량, G/N 명령은 마스터에서 수행됩니다. 
이 외 명령(홀드, 리셋 등)은 클라이언트가 직접 수행합니다. 
13. 에러 메세지 
CH 01 
CH 02 
측정값이 최대용량을 초과하였습니다. 
측정 센서의 연결 상태를 확인하세요. 
CH 03 
비교기 모드 설정 값을 확인하세요. 
62 
AI-850 Weighing Indicator                                            
14. 펌웨어 업데이트 
펌웨어 업데이트를 위해 Tera Term을 다운로드 하십시오. 
다운로드 경로: https://tera-term.softonic.kr 
로딩 화면에서 터치 세 번을 하면 펌웨어 업데이트 모드로 진입합니다. 
펌웨어 업데이트 모드 진입하였다면 Tera Term의 시리얼포트를 설정합니다. 
[설정] - [시리얼포트] 메뉴에서 올바른 시리얼 포트를 선택하고 속도를 460800으로 
설정하십시오. 
[메뉴] – [전송] – [YMODEM] – [보내기]로 펌웨어 파일을 보내어 업데이트를 완료합니다. 
업데이트에 문제가 있는 경우 
[장치 관리자] - [포트] – [USB Serial Port 속성] – 
[고급 설정] 메뉴에 진입하세요. 
USB 전송 크기의 송수신 바이트를 낮춘 후, 
업데이트를 수행해주십시오.  
63 
[NOTE]